Tekla Open API Reference for Tekla Structures 2025
Projection.PointToPlane Method
 Returns a new point which is a projection of the given point onto the given plane.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static Point PointToPlane(
	Point Point,
	GeometricPlane Plane
)
Public Shared Function PointToPlane (
	Point As Point,
	Plane As GeometricPlane
) As Point
Parameters
Point
Type: Tekla.Structures.Geometry3d.Point
The point to be used.
Plane
Type: Tekla.Structures.Geometry3d.GeometricPlane
The plane to be used.
Return Value
Type: Point
The new projection point.
See Also
Reference
Projection Class
Tekla.Structures.Geometry3d Namespace